Revit 2027 API
Space.UpperLimit Property
Get or set the Upper Limit of the Space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Level UpperLimit { get; set; }
Public Property UpperLimit As Level
	Get
	Set
public:
property Level^ UpperLimit {
	Level^ get ();
	void set (Level^ value);
}
member UpperLimit : Level with get, set
Property Value
Level
Remarks
This property is used to get or set the Upper Limit of the Space.
See Also
Reference
Space Class
Autodesk.Revit.DB.Mechanical Namespace